app/controllers/articles_controller.rb

  def index
  	# Todos los registros
  	@articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
  		# insert into
  	@article = current_user.articles.new(article_params)

  	if @article.save
---
INSERT INTO "articles" ("title", "body", "visits_count", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
  	# delete from articles

  	@article.destroy # destroy elimina el objeto de la base de datos
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]

  def update
  	# update
  	# @article.update_attributes({titulo: 'nuevo titulo'})
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Segundo articulo :V"], ["body", "Segundo ejemplo de un articulo para esta aplicacion jajaja"], ["updated_at", "2020-03-04 05:13:41.468052"], ["id", 10]]