app/models/article.rb

	def update_visits_count
		#self.save if self.visits_count.nil?
	 	self.update(visits_count: self.visits_count + 1)
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 0], ["updated_at", "2020-03-05 05:56:59.473354"], ["id", 13]]